.config/doom/config.org
#+TITLE: Doom Emacs Configuration
#+AUTHOR: Antonio Peris Sanchez
#+EMAIL: perissanchezantonio@gmail.com
#+PROPERTY: header-args:emacs-lisp :tangle yes :comments link

* Table of Contents :TOC:
- [[#introduction][Introduction]]
- [[#basic-configuration][Basic Configuration]]
- [[#ui-configuration][UI Configuration]]
  - [[#font][Font]]
  - [[#theme][Theme]]
  - [[#line-numbers][Line Numbers]]
- [[#editor-settings][Editor Settings]]
  - [[#scroll-offset][Scroll Offset]]
- [[#keybindings][Keybindings]]
  - [[#window-splits][Window Splits]]
  - [[#motion-and-scrolling][Motion and Scrolling]]
  - [[#editing][Editing]]
  - [[#toggles][Toggles]]
- [[#environment-setup][Environment Setup]]
- [[#debugger-setup][Debugger Setup]]
- [[#programming-languages-configurations][Programming Languages Configurations]]
  - [[#rust][Rust]]
  - [[#c][C++]]
  - [[#c-1][C]]
  - [[#zig][Zig]]
  - [[#go][Go]]
  - [[#python][Python]]
  - [[#lua][Lua]]
- [[#org-mode][Org Mode]]
  - [[#org-directory][Org Directory]]
  - [[#org-roam][Org Roam]]
  - [[#org-headings][Org Headings]]

* Introduction

This is a literate configuration for Doom Emacs

* Basic Configuration

Basic user information for Emacs.

#+begin_src emacs-lisp
(setq confirm-kill-emacs nil)

(setq user-full-name "Antonio Peris Sanchez"
      user-mail-address "perissanchezantonio@gmail.com")

;; Don't show dashboard when starting client from daemon
(setq initial-buffer-choice nil)
#+end_src

* UI Configuration
** Font

Using Terminess Nerd Font Mono and Noto Sans SC for chinese characters

#+begin_src emacs-lisp
;; Main font
(setq doom-font (font-spec :family "Terminess Nerd Font Mono" :size 12.0))

;; Chinese font for CJK characters
(add-hook 'doom-init-ui-hook
          (lambda ()
            (dolist (charset '(kana han cjk-misc bopomofo))
              (set-fontset-font t charset (font-spec :family "Noto Sans SC" :size 12.0)))))
#+end_src

** Theme

Use Catppuccin Mocha theme

#+begin_src emacs-lisp
(setq doom-theme 'catppuccin)
(setq catppuccin-flavor 'mocha)
(load-theme 'catppuccin t)
#+end_src

** Line Numbers

Enable line numbers

#+begin_src emacs-lisp
(setq display-line-numbers-type t)
#+end_src

* Editor Settings

Core editor behavior and display settings.

** Scroll Offset

Keep cursor centered with scroll offset - always show context above/below and left/right of cursor.

#+begin_src emacs-lisp
(setq scroll-margin 10                  ; 10 lines above/below cursor
      scroll-conservatively 101          ; Scroll smoothly
      scroll-preserve-screen-position t  ; Keep cursor position when scrolling
      hscroll-margin 10                  ; 10 columns left/right of cursor
      hscroll-step 1)                    ; Smooth horizontal scrolling
#+end_src

* Keybindings
** Window Splits

Tmux-style window splitting with =SPC w %= and =SPC w "=
Additional bindings for closing windows.

#+begin_src emacs-lisp
(map! :leader
      :prefix "w"
      :desc "Split window right" "%" #'evil-window-vsplit
      :desc "Split window below" "\"" #'evil-window-split
      :desc "Kill window" "k" #'evil-window-delete
      :desc "Kill window" "x" #'evil-window-delete)
#+end_src

** Motion and Scrolling

Auto-center the cursor after scrolling and searching for better visibility.

#+begin_src emacs-lisp
;; Center cursor after scrolling
(map! :n "C-d" (cmd! (evil-scroll-down 0) (evil-scroll-line-to-center (line-number-at-pos)))
      :n "C-u" (cmd! (evil-scroll-up 0) (evil-scroll-line-to-center (line-number-at-pos))))

;; Center cursor after jumping to changes
(map! :n "g," (cmd! (evil-goto-last-change) (evil-scroll-line-to-center (line-number-at-pos)))
      :n "g;" (cmd! (evil-goto-last-change-reverse) (evil-scroll-line-to-center (line-number-at-pos))))
#+end_src

** Editing

Quality of life improvements for editing and window management.

#+begin_src emacs-lisp
;; Insert blank lines without entering insert mode
(map! :n "]<SPC>" (cmd! (evil-open-below 1) (forward-line -1))
      :n "[<SPC>" (cmd! (evil-open-above 1) (forward-line 1)))

;; Resize windows with Shift + arrow keys
(map! :n "S-<up>"    (cmd! (evil-window-increase-height 2))
      :n "S-<down>"  (cmd! (evil-window-decrease-height 2))
      :n "S-<right>" (cmd! (evil-window-increase-width 2))
      :n "S-<left>"  (cmd! (evil-window-decrease-width 2)))
#+end_src

** Toggles

Toggle functions for common settings with =SPC t= prefix.

#+begin_src emacs-lisp
;; Toggle whitespace visualization
(defun my/toggle-whitespace ()
  (interactive)
  (if whitespace-mode
      (progn
        (whitespace-mode -1)
        (message "Whitespace visualization: OFF"))
    (progn
      (setq-local whitespace-style '(face tabs spaces trailing space-before-tab
                                     newline indentation empty space-after-tab
                                     space-mark tab-mark newline-mark))
      (whitespace-mode 1)
      (message "Whitespace visualization: ON"))))

(map! :leader
      :prefix "t"
      :desc "Toggle whitespace" "w" #'my/toggle-whitespace)
#+end_src

* Environment Setup

Sync exec-path from PATH environment variable so Emacs can find all executables.
Doom's env file sets PATH correctly, but exec-path needs to be updated from it.

#+begin_src emacs-lisp
;; Sync exec-path from PATH environment variable
;; This ensures Emacs can find all executables without hardcoding paths
(setq exec-path (append (parse-colon-path (getenv "PATH")) exec-path))
#+end_src

* Debugger Setup

Global debugger configuration using dape (Debug Adapter Protocol for Emacs).

#+begin_src emacs-lisp
;; Load dape and enable global breakpoint mode
(use-package! dape
  :config
  ;; Enable global breakpoint mode so we can set breakpoints anytime
  (dape-breakpoint-global-mode +1))
#+end_src

* Programming Languages Configurations

This section contains configurations for all programming languages I use,
organized similarly to my Neovim setup.

** Rust
*** LSP Configuration

Configure rust-analyzer with clippy for enhanced linting, inlay hints, and advanced features.

#+begin_src emacs-lisp
(after! lsp-mode
  (setq lsp-rust-analyzer-cargo-watch-command "clippy"
        lsp-rust-analyzer-check-on-save-command "clippy"

        ;; Inlay hints
        lsp-rust-analyzer-server-display-inlay-hints t
        lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial"
        lsp-rust-analyzer-display-chaining-hints t
        lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil
        lsp-rust-analyzer-display-closure-return-type-hints t
        lsp-rust-analyzer-display-parameter-hints nil
        lsp-rust-analyzer-display-reborrow-hints nil

        ;; Cargo features
        lsp-rust-analyzer-cargo-load-out-dirs-from-check t
        lsp-rust-analyzer-cargo-all-targets t
        lsp-rust-analyzer-proc-macro-enable t

        ;; Import settings
        lsp-rust-analyzer-import-granularity "module"
        lsp-rust-analyzer-import-prefix "by-self"

        ;; Semantic highlighting - disable mutable variable underlining
        lsp-rust-analyzer-highlighting-mutable-underline nil
        lsp-rust-analyzer-highlighting-mutable-emphasis "none"))
#+end_src

*** Debugger Configuration

Configure debugging for Rust using lldb-dap.

#+begin_src emacs-lisp
(after! dape
  (add-to-list 'dape-configs
               `(rust-lldb
                 modes (rust-mode rust-ts-mode)
                 command ,(or (executable-find "lldb-dap") "lldb-dap")
                 command-args ()
                 fn (lambda (config)
                      (plist-put config :program
                                (let ((root (dape--guess-root config)))
                                  (read-file-name "Rust binary to debug: "
                                                (file-name-concat root "target/debug/"))))
                      config)
                 :type "lldb"
                 :request "launch"
                 :cwd dape-cwd-fn
                 :program ""
                 :args []
                 :stopOnEntry nil)))
#+end_src

** C++
