.config/doom/config.el
;; [[file:config.org::*Basic Configuration][Basic Configuration:1]]
(setq confirm-kill-emacs nil)

(setq user-full-name "Antonio Peris Sanchez"
      user-mail-address "perissanchezantonio@gmail.com")

;; Don't show dashboard when starting client from daemon
(setq initial-buffer-choice nil)
;; Basic Configuration:1 ends here

;; [[file:config.org::*Font][Font:1]]
;; Main font
(setq doom-font (font-spec :family "Terminess Nerd Font Mono" :size 12.0))

;; Chinese font for CJK characters
(add-hook 'doom-init-ui-hook
          (lambda ()
            (dolist (charset '(kana han cjk-misc bopomofo))
              (set-fontset-font t charset (font-spec :family "Noto Sans SC" :size 12.0)))))
;; Font:1 ends here

;; [[file:config.org::*Theme][Theme:1]]
(setq doom-theme 'catppuccin)
(setq catppuccin-flavor 'mocha)
(load-theme 'catppuccin t)
;; Theme:1 ends here

;; [[file:config.org::*Line Numbers][Line Numbers:1]]
(setq display-line-numbers-type t)
;; Line Numbers:1 ends here

;; [[file:config.org::*Scroll Offset][Scroll Offset:1]]
(setq scroll-margin 10                  ; 10 lines above/below cursor
      scroll-conservatively 101          ; Scroll smoothly
      scroll-preserve-screen-position t  ; Keep cursor position when scrolling
      hscroll-margin 10                  ; 10 columns left/right of cursor
      hscroll-step 1)                    ; Smooth horizontal scrolling
;; Scroll Offset:1 ends here

;; [[file:config.org::*Window Splits][Window Splits:1]]
(map! :leader
      :prefix "w"
      :desc "Split window right" "%" #'evil-window-vsplit
      :desc "Split window below" "\"" #'evil-window-split
      :desc "Kill window" "k" #'evil-window-delete
      :desc "Kill window" "x" #'evil-window-delete)
;; Window Splits:1 ends here

;; [[file:config.org::*Motion and Scrolling][Motion and Scrolling:1]]
;; Center cursor after scrolling
(map! :n "C-d" (cmd! (evil-scroll-down 0) (evil-scroll-line-to-center (line-number-at-pos)))
      :n "C-u" (cmd! (evil-scroll-up 0) (evil-scroll-line-to-center (line-number-at-pos))))

;; Center cursor after jumping to changes
(map! :n "g," (cmd! (evil-goto-last-change) (evil-scroll-line-to-center (line-number-at-pos)))
      :n "g;" (cmd! (evil-goto-last-change-reverse) (evil-scroll-line-to-center (line-number-at-pos))))
;; Motion and Scrolling:1 ends here

;; [[file:config.org::*Editing][Editing:1]]
;; Insert blank lines without entering insert mode
(map! :n "]<SPC>" (cmd! (evil-open-below 1) (forward-line -1))
      :n "[<SPC>" (cmd! (evil-open-above 1) (forward-line 1)))

;; Resize windows with Shift + arrow keys
(map! :n "S-<up>"    (cmd! (evil-window-increase-height 2))
      :n "S-<down>"  (cmd! (evil-window-decrease-height 2))
      :n "S-<right>" (cmd! (evil-window-increase-width 2))
      :n "S-<left>"  (cmd! (evil-window-decrease-width 2)))
;; Editing:1 ends here

;; [[file:config.org::*Toggles][Toggles:1]]
;; Toggle whitespace visualization
(defun my/toggle-whitespace ()
  (interactive)
  (if whitespace-mode
      (progn
        (whitespace-mode -1)
        (message "Whitespace visualization: OFF"))
    (progn
      (setq-local whitespace-style '(face tabs spaces trailing space-before-tab
                                     newline indentation empty space-after-tab
                                     space-mark tab-mark newline-mark))
      (whitespace-mode 1)
      (message "Whitespace visualization: ON"))))

(map! :leader
      :prefix "t"
      :desc "Toggle whitespace" "w" #'my/toggle-whitespace)
;; Toggles:1 ends here

;; [[file:config.org::*Environment Setup][Environment Setup:1]]
;; Sync exec-path from PATH environment variable
;; This ensures Emacs can find all executables without hardcoding paths
(setq exec-path (append (parse-colon-path (getenv "PATH")) exec-path))
;; Environment Setup:1 ends here

;; [[file:config.org::*Debugger Setup][Debugger Setup:1]]
;; Load dape and enable global breakpoint mode
(use-package! dape
  :config
  ;; Enable global breakpoint mode so we can set breakpoints anytime
  (dape-breakpoint-global-mode +1))
;; Debugger Setup:1 ends here

;; [[file:config.org::*LSP Configuration][LSP Configuration:1]]
(after! lsp-mode
  (setq lsp-rust-analyzer-cargo-watch-command "clippy"
        lsp-rust-analyzer-check-on-save-command "clippy"

        ;; Inlay hints
        lsp-rust-analyzer-server-display-inlay-hints t
        lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial"
        lsp-rust-analyzer-display-chaining-hints t
        lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil
        lsp-rust-analyzer-display-closure-return-type-hints t
        lsp-rust-analyzer-display-parameter-hints nil
        lsp-rust-analyzer-display-reborrow-hints nil

        ;; Cargo features
        lsp-rust-analyzer-cargo-load-out-dirs-from-check t
        lsp-rust-analyzer-cargo-all-targets t
        lsp-rust-analyzer-proc-macro-enable t

        ;; Import settings
        lsp-rust-analyzer-import-granularity "module"
        lsp-rust-analyzer-import-prefix "by-self"

        ;; Semantic highlighting - disable mutable variable underlining
        lsp-rust-analyzer-highlighting-mutable-underline nil
        lsp-rust-analyzer-highlighting-mutable-emphasis "none"))
;; LSP Configuration:1 ends here

;; [[file:config.org::*Debugger Configuration][Debugger Configuration:1]]
(after! dape
  (add-to-list 'dape-configs
               `(rust-lldb
                 modes (rust-mode rust-ts-mode)
                 command ,(or (executable-find "lldb-dap") "lldb-dap")
                 command-args ()
                 fn (lambda (config)
                      (plist-put config :program
                                (let ((root (dape--guess-root config)))
                                  (read-file-name "Rust binary to debug: "
                                                (file-name-concat root "target/debug/"))))
                      config)
                 :type "lldb"
                 :request "launch"
                 :cwd dape-cwd-fn
                 :program ""
                 :args []
                 :stopOnEntry nil)))
;; Debugger Configuration:1 ends here

;; [[file:config.org::*LSP Configuration][LSP Configuration:1]]
(after! lsp-mode
