.config/doom/config.org
*** LSP Configuration

Configure clangd for C++ development with inlay hints and advanced features.

#+begin_src emacs-lisp
(after! lsp-mode
  ;; Using BACKGROUND INDEXING for UE5 (necessary for complete symbol resolution)
  (setq lsp-clients-clangd-args '("-j=4"
                                  "--background-index"
                                  "--completion-style=detailed"
                                  "--header-insertion=never"
                                  "--pch-storage=disk"
                                  "--enable-config"
                                  "--all-scopes-completion"
                                  "--limit-results=100")))

;; Enable inlay hints for C++ (if using lsp-mode with inlay hint support)
(after! lsp-mode
  (setq lsp-inlay-hint-enable t))
#+end_src

*** Debugger Configuration

Configure debugging for C++ using lldb-dap.

#+begin_src emacs-lisp
(after! dape
  (add-to-list 'dape-configs
               `(cpp-lldb
                 modes (c++-mode c++-ts-mode)
                 command ,(or (executable-find "lldb-dap") "lldb-dap")
                 command-args ()
                 fn (lambda (config)
                      (plist-put config :program
                                (read-file-name "C++ binary to debug: "
                                              (dape--guess-root config)))
                      config)
                 :type "lldb"
                 :request "launch"
                 :cwd dape-cwd-fn
                 :program ""
                 :args []
                 :stopOnEntry nil)))
#+end_src

** C
*** LSP Configuration

Configure clangd for C development with inlay hints and advanced features.
Uses the same clangd configuration as C++.

*** Debugger Configuration

Configure debugging for C using lldb-dap.

#+begin_src emacs-lisp
(after! dape
  (add-to-list 'dape-configs
               `(c-lldb
                 modes (c-mode c-ts-mode)
                 command ,(or (executable-find "lldb-dap") "lldb-dap")
                 command-args ()
                 fn (lambda (config)
                      (plist-put config :program
                                (read-file-name "C binary to debug: "
                                              (dape--guess-root config)))
                      config)
                 :type "lldb"
                 :request "launch"
                 :cwd dape-cwd-fn
                 :program ""
                 :args []
                 :stopOnEntry nil)))
#+end_src

** Zig
*** LSP Configuration

Configure ZLS (Zig Language Server) with semantic tokens and advanced features.
The (zig +lsp) module automatically handles zls startup - zls is found via PATH.

#+begin_src emacs-lisp
(after! lsp-zig
  ;; ZLS will be found automatically via PATH
  (setq lsp-zig-enable-inlay-hints t
        lsp-zig-enable-autofix t))

;; Enable inlay hints for Zig (LSP is already enabled by +lsp module)
(after! zig-mode
  (add-hook 'zig-mode-hook #'lsp-inlay-hints-mode))
#+end_src

*** Debugger Configuration

Configure debugging for Zig using lldb-dap.

#+begin_src emacs-lisp
(after! dape
  (add-to-list 'dape-configs
               `(zig-lldb
                 modes (zig-mode zig-ts-mode)
                 command ,(or (executable-find "lldb-dap") "lldb-dap")
                 command-args ()
                 fn (lambda (config)
                      (plist-put config :program
                                (let ((root (dape--guess-root config)))
                                  (read-file-name "Zig binary to debug: "
                                                (file-name-concat root "zig-out/bin/"))))
                      config)
                 :type "lldb"
                 :request "launch"
                 :cwd dape-cwd-fn
                 :program ""
                 :args []
                 :stopOnEntry nil)))
#+end_src

** Go
*** LSP Configuration

Configure gopls with inlay hints and static analysis.

#+begin_src emacs-lisp
(after! lsp-mode
  (setq lsp-go-analyses '((nilness . t)
                          (unusedparams . t)
                          (unusedwrite . t)
                          (useany . t))
        lsp-go-codelenses '((generate . t)
                            (test . t)
                            (tidy . t)
                            (upgrade_dependency . t)
                            (vendor . t))
        lsp-go-use-gofumpt t
        lsp-go-hints '((assignVariableTypes . t)
                       (compositeLiteralFields . t)
                       (compositeLiteralTypes . t)
                       (constantValues . t)
                       (functionTypeParameters . t)
                       (parameterNames . t)
                       (rangeVariableTypes . t))))
#+end_src

*** Debugger Configuration

Configure debugging for Go using Delve (dlv) in DAP mode.
Three configurations for different debugging modes:
- dlv-debug: Compile and debug Go source code
- dlv-exec: Debug a pre-compiled binary
- dlv-test: Debug Go tests

#+begin_src emacs-lisp
(after! dape
  ;; 1. Debug mode: Compile and debug source code
  (add-to-list 'dape-configs
               `(dlv-debug
                 modes (go-mode go-ts-mode)
                 ensure dape-ensure-command
                 command "dlv"
                 command-args ("dap" "--listen" "127.0.0.1::autoport")
                 command-insert-stderr t
                 port :autoport
                 fn (lambda (config)
                      (let* ((root (dape--guess-root config))
                             (default-dir (if (file-exists-p (concat root "cmd/"))
                                            (concat root "cmd/")
                                            root))
                             (selected-path (read-directory-name "Go package to debug: " default-dir)))
                        (plist-put config :program
                                  (expand-file-name selected-path)))
                      config)
                 :type "go"
                 :request "launch"
                 :mode "debug"
                 :cwd dape-cwd-fn
                 :program ""
                 :args []))

  ;; 2. Exec mode: Debug pre-compiled binary
  (add-to-list 'dape-configs
               `(dlv-exec
                 modes (go-mode go-ts-mode)
                 ensure dape-ensure-command
                 command "dlv"
                 command-args ("dap" "--listen" "127.0.0.1::autoport")
                 command-insert-stderr t
                 port :autoport
                 fn (lambda (config)
                      (let* ((root (dape--guess-root config))
                             (default-dir (if (file-exists-p (concat root "build/"))
                                            (concat root "build/")
                                            root))
                             (selected-binary (read-file-name "Go binary to debug: " default-dir)))
                        (plist-put config :program
                                  (expand-file-name selected-binary)))
                      config)
                 :type "go"
                 :request "launch"
                 :mode "exec"
                 :cwd dape-cwd-fn
                 :program ""
                 :args []))

  ;; 3. Test mode: Debug Go tests
  (add-to-list 'dape-configs
               `(dlv-test
                 modes (go-mode go-ts-mode)
                 ensure dape-ensure-command
                 command "dlv"
                 command-args ("dap" "--listen" "127.0.0.1::autoport")
                 command-insert-stderr t
                 port :autoport
                 fn (lambda (config)
                      (plist-put config :program
                                (file-name-directory (buffer-file-name)))
                      config)
                 :type "go"
                 :request "launch"
                 :mode "test"
                 :cwd dape-cwd-fn
                 :program ""
                 :args [])))
#+end_src

** Python
