.config/doom/config.org
*** LSP Configuration

Configure Python with dual LSP setup: Pyright for type checking and Ruff for fast linting.

#+begin_src emacs-lisp
(after! lsp-mode
  ;; Load Pyright LSP client
  (require 'lsp-pyright)

  ;; Pyright configuration - type checking and completions
  (setq lsp-pyright-typechecking-mode "basic"
        lsp-pyright-disable-organize-imports nil

        ;; Auto-import and completions
        lsp-pyright-auto-import-completions t
        lsp-pyright-use-library-code-for-types t

        ;; Diagnostics
        lsp-pyright-diagnostic-mode "workspace"

        ;; Virtual environment support
        lsp-pyright-venv-path (expand-file-name "~/.virtualenvs")))

;; Python-specific: enable inlay hints
(after! python-mode
  (add-hook 'python-mode-hook #'lsp-inlay-hints-mode))
#+end_src

*** Debugger Configuration

Configure debugging for Python using debugpy (Python's Debug Adapter Protocol).
Prompts for which Python file to run, allowing you to set breakpoints in one file
and debug from a different entry point (e.g., main.py).

#+begin_src emacs-lisp
(after! dape
  (add-to-list 'dape-configs
               `(debugpy
                 modes (python-mode python-ts-mode)
                 ensure dape-ensure-command
                 command "python3"
                 command-args ("-m" "debugpy.adapter")
                 fn (lambda (config)
                      (let* ((current-dir (file-name-directory (buffer-file-name)))
                             (selected-file (read-file-name "Python file to run: " current-dir)))
                        (plist-put config :program (expand-file-name selected-file)))
                      config)
                 :request "launch"
                 :type "executable"
                 :cwd dape-cwd-fn
                 :program ""
                 :args [])))
#+end_src

** Lua
*** LSP Configuration

Configure lua-language-server with inlay hints, runtime version, and diagnostics.

#+begin_src emacs-lisp
(after! lsp-mode
  (setq lsp-lua-hint-enable t
        lsp-lua-hint-set-type t
        lsp-lua-hint-param-type t

        ;; Runtime configuration
        lsp-lua-runtime-version "LuaJIT"

        ;; Completion
        lsp-lua-completion-call-snippet "Both"
        lsp-lua-completion-keyword-snippet "Both"

        ;; Diagnostics
        lsp-lua-diagnostics-enable t
        lsp-lua-diagnostics-globals '("vim")  ; If using Neovim Lua API

        ;; Semantic highlighting
        lsp-semantic-tokens-enable t))
#+end_src
* Org Mode
** Org Directory

Set the default directory for org files.

#+begin_src emacs-lisp
(setq org-directory "~/Org/org/")
(add-hook 'org-mode-hook #'hl-todo-mode)
#+end_src

** Org Roam

Configuration for org-roam note-taking system.

#+begin_src emacs-lisp
(use-package! org-roam
  :after org
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/Org/org-roam")
  :config
  (org-roam-db-autosync-enable))
#+end_src

** Org Headings

Scale org headings for better visual hierarchy in documents.

#+begin_src emacs-lisp
(custom-theme-set-faces!
  'doom-one
  '(org-level-8 :inherit outline-3 :height 1.0)
  '(org-level-7 :inherit outline-3 :height 1.0)
  '(org-level-6 :inherit outline-3 :height 1.1)
  '(org-level-5 :inherit outline-3 :height 1.2)
  '(org-level-4 :inherit outline-3 :height 1.3)
  '(org-level-3 :inherit outline-3 :height 1.4)
  '(org-level-2 :inherit outline-3 :height 1.5)
  '(org-level-1 :inherit outline-3 :height 1.6)
  '(org-document-title :height 2.0 :bold t :underline nil))
#+end_src
