.config/doom/config.el
  ;; Load Pyright LSP client
  (require 'lsp-pyright)

  ;; Pyright configuration - type checking and completions
  (setq lsp-pyright-typechecking-mode "basic"
        lsp-pyright-disable-organize-imports nil

        ;; Auto-import and completions
        lsp-pyright-auto-import-completions t
        lsp-pyright-use-library-code-for-types t

        ;; Diagnostics
        lsp-pyright-diagnostic-mode "workspace"

        ;; Virtual environment support
        lsp-pyright-venv-path (expand-file-name "~/.virtualenvs")))

;; Python-specific: enable inlay hints
(after! python-mode
  (add-hook 'python-mode-hook #'lsp-inlay-hints-mode))
;; LSP Configuration:1 ends here

;; [[file:config.org::*Debugger Configuration][Debugger Configuration:1]]
(after! dape
  (add-to-list 'dape-configs
               `(debugpy
                 modes (python-mode python-ts-mode)
                 ensure dape-ensure-command
                 command "python3"
                 command-args ("-m" "debugpy.adapter")
                 fn (lambda (config)
                      (let* ((current-dir (file-name-directory (buffer-file-name)))
                             (selected-file (read-file-name "Python file to run: " current-dir)))
                        (plist-put config :program (expand-file-name selected-file)))
                      config)
                 :request "launch"
                 :type "executable"
                 :cwd dape-cwd-fn
                 :program ""
                 :args [])))
;; Debugger Configuration:1 ends here

;; [[file:config.org::*LSP Configuration][LSP Configuration:1]]
(after! lsp-mode
  (setq lsp-lua-hint-enable t
        lsp-lua-hint-set-type t
        lsp-lua-hint-param-type t

        ;; Runtime configuration
        lsp-lua-runtime-version "LuaJIT"

        ;; Completion
        lsp-lua-completion-call-snippet "Both"
        lsp-lua-completion-keyword-snippet "Both"

        ;; Diagnostics
        lsp-lua-diagnostics-enable t
        lsp-lua-diagnostics-globals '("vim")  ; If using Neovim Lua API

        ;; Semantic highlighting
        lsp-semantic-tokens-enable t))
;; LSP Configuration:1 ends here

;; [[file:config.org::*Org Directory][Org Directory:1]]
(setq org-directory "~/Org/org/")
(add-hook 'org-mode-hook #'hl-todo-mode)
;; Org Directory:1 ends here

;; [[file:config.org::*Org Roam][Org Roam:1]]
(use-package! org-roam
  :after org
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/Org/org-roam")
  :config
  (org-roam-db-autosync-enable))
;; Org Roam:1 ends here

;; [[file:config.org::*Org Headings][Org Headings:1]]
(custom-theme-set-faces!
  'doom-one
  '(org-level-8 :inherit outline-3 :height 1.0)
  '(org-level-7 :inherit outline-3 :height 1.0)
  '(org-level-6 :inherit outline-3 :height 1.1)
  '(org-level-5 :inherit outline-3 :height 1.2)
  '(org-level-4 :inherit outline-3 :height 1.3)
  '(org-level-3 :inherit outline-3 :height 1.4)
  '(org-level-2 :inherit outline-3 :height 1.5)
  '(org-level-1 :inherit outline-3 :height 1.6)
  '(org-document-title :height 2.0 :bold t :underline nil))
;; Org Headings:1 ends here
